
## Plan Result




<pre><code>Plan: 2 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-password&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-url&#34;]
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main will be updated in-place
  ~ resource "azurerm_automation_runbook" "main" {
      ~ content                  = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
          -     Write-Output "Generating Token in SA $storage_account_name"
          +     #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
          -     Write-Output "Context is $context"
          -     Write-Output "Storage context is $storage_context"
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
                Write-Host "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
                Write-host "Bypass required, add rule for $ip in $key_vault_name"
                Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
              Write-host "Removing rule for $ip in $key_vault_name"
              Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
            }
        EOT
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rl"
        name                     = "rotate-sas-tokens-hmisastg-rota-rl"
        tags                     = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "application"         = "hearings-management-interface"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2023-06-16T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2023-06-15T14:03:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2023-06-16T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2023-06-15T14:03:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://hmi-kv-stg.vault.azure.net/secrets/sn-password/d2935c27448a442393835bf369063670"
        name                    = "sn-password"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "application"         = "hearings-management-interface"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
            "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://hmi-kv-stg.vault.azure.net/secrets/sn-url/38b06aea01fa4f17a7621a8fd235e880"
        name                    = "sn-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "application"         = "hearings-management-interface"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
            "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-rota|hmi-kv-stg-shared-rota"
        name                       = "hmi-kv-stg-shared-rota"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 9 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Vars":{}} -->